spec/fixtures/stripe/create_subscription_response.json

{
  "id": "sub_FeRr51Jussa4L9",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1566818638,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "collection_method": "charge_automatically",
  "created": 1566213838,
  "current_period_end": 1566818638,
  "current_period_start": 1566213838,
  "customer": "cus_FeRr0EWLFy9a5c",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_FeRr3LRSui6uYv",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1566213839,
        "metadata": {},
        "plan": {
          "id": "test-mubaohLn5BuRVQ8rOE4M",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 999,
          "billing_scheme": "per_unit",
          "created": 1462284968,
          "currency": "eur",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "product": "prod_BTuUwcCciIESD8",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": 7,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_FeRr51Jussa4L9",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_FeRr51Jussa4L9"
  },
  "latest_invoice": null,
  "livemode": false,
  "metadata": {},
  "pending_setup_intent": null,
  "plan": {
    "id": "test-mubaohLn5BuRVQ8rOE4M",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 999,
    "billing_scheme": "per_unit",
    "created": 1462284968,
    "currency": "eur",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": null,
    "product": "prod_BTuUwcCciIESD8",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": 7,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1566213838,
  "start_date": 1566213838,
  "status": "active",
  "tax_percent": null,
  "trial_end": 1566818638,
  "trial_start": 1566213838
}